{
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workbookDisplayName": {
      "type": "string",
      "defaultValue": "Sentinel Assessment Workbook",
      "metadata": {
        "description": "The friendly name for the workbook that is used in the Gallery or Saved List.  This name must be unique within a resource group."
      }
    },
    "workbookType": {
      "type": "string",
      "defaultValue": "sentinel",
      "metadata": {
        "description": "The gallery that the workbook will been shown under. Supported values include workbook, tsg, etc. Usually, this is 'workbook'"
      }
    },
    "workbookSourceId": {
      "type": "string",
      "defaultValue": "",
      "metadata": {
        "description": "The id of resource instance to which the workbook will be associated"
      }
    },
    "workbookId": {
      "type": "string",
      "defaultValue": "[newGuid()]",
      "metadata": {
        "description": "The unique guid for this workbook instance"
      }
    }
  },
  "variables": {
    "workbookContent": {
      "version": "Notebook/1.0",
      "items": [
        {
          "type": 1,
          "content": {
            "json": "# Microsoft Sentinel Asset Inventory"
          },
          "name": "Page header"
        },
        {
          "type": 9,
          "content": {
            "version": "KqlParameterItem/1.0",
            "parameters": [
              {
                "id": "26d2fea7-3646-4993-b79f-6722f9ef8ddb",
                "version": "KqlParameterItem/1.0",
                "name": "DefaultSubscription_Internal",
                "type": 1,
                "isRequired": true,
                "query": "where type =~ 'microsoft.operationalinsights/workspaces'\n| take 1\n| project subscriptionId",
                "isHiddenWhenLocked": true,
                "timeContextFromParameter": "TimeRange",
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              {
                "id": "109f8d4a-05e3-4d1b-adac-087873d109a6",
                "version": "KqlParameterItem/1.0",
                "name": "InternalWSs",
                "type": 1,
                "isRequired": true,
                "query": "SecurityIncident \n| where TimeGenerated > ago(90d)\n| parse IncidentUrl with * \"/workspaces/\" Workspace \"/\" *\n| project Workspace",
                "value": "siemens-h-law-sentinel-dev, siemens-h-law-sentinel-dev",
                "isHiddenWhenLocked": true,
                "timeContext": {
                  "durationMs": 2592000000
                },
                "queryType": 0,
                "resourceType": "microsoft.operationalinsights/workspaces"
              },
              {
                "id": "55d3ab63-6e1f-4d02-8d9e-2225526689c7",
                "version": "KqlParameterItem/1.0",
                "name": "Subscription",
                "type": 6,
                "query": "summarize by subscriptionId\n| project value = strcat(\"/subscriptions/\", subscriptionId), label = subscriptionId, selected = iff(subscriptionId =~ '{DefaultSubscription_Internal}', true, false)",
                "crossComponentResources": [
                  "value::all"
                ],
                "typeSettings": {
                  "additionalResourceOptions": [],
                  "showDefault": false
                },
                "timeContext": {
                  "durationMs": 0
                },
                "timeContextFromParameter": "TimeRange",
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              {
                "id": "95a45501-31b5-4ea2-bcb3-eb208e0080e2",
                "version": "KqlParameterItem/1.0",
                "name": "Workspace",
                "type": 5,
                "isRequired": true,
                "query": "where type =~ \"microsoft.operationalinsights/workspaces\"\r\n| project subscriptionId,id,name\r\n| where '{Subscription}' has subscriptionId\r\n| project value =id, label = name, selected = iff(name =~ '{InternalWSs}', true, false)",
                "crossComponentResources": [
                  "value::all"
                ],
                "value": "/subscriptions/ce4590de-b52b-4c26-8232-37b0a5676300/resourceGroups/Siemens-H-Dev/providers/Microsoft.OperationalInsights/workspaces/siemens-h-law-sentinel-dev",
                "typeSettings": {
                  "additionalResourceOptions": [],
                  "showDefault": false
                },
                "timeContextFromParameter": "TimeRange",
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              {
                "id": "9a199167-2dde-49dd-8f01-23e9d1fa8151",
                "version": "KqlParameterItem/1.0",
                "name": "InternalRG",
                "type": 1,
                "isRequired": true,
                "query": "where type =~ \"microsoft.operationalinsights/workspaces\"\r\n| where id =~  \"{Workspace}\"\r\n| project resourceGroup",
                "crossComponentResources": [
                  "{Workspace}"
                ],
                "isHiddenWhenLocked": true,
                "timeContext": {
                  "durationMs": 2592000000
                },
                "timeContextFromParameter": "TimeRange",
                "queryType": 1,
                "resourceType": "microsoft.resourcegraph/resources"
              },
              {
                "id": "c4470c37-5a8a-4ecd-8ece-5e98db8e8a92",
                "version": "KqlParameterItem/1.0",
                "name": "Help",
                "label": "Show Help",
                "type": 10,
                "description": "This will show some help information to help you understand the page you are on",
                "isRequired": true,
                "typeSettings": {
                  "additionalResourceOptions": []
                },
                "jsonData": "[[{ \"value\": \"Yes\", \"label\": \"Yes\"},\r\n {\"value\": \"No\", \"label\": \"No\", \"selected\":true }]",
                "value": "Yes"
              },
              {
                "id": "65256d7a-2004-44e8-a943-1f489beb4e00",
                "version": "KqlParameterItem/1.0",
                "name": "TimeRange",
                "type": 4,
                "value": {
                  "durationMs": 7776000000
                },
                "typeSettings": {
                  "selectableValues": [
                    {
                      "durationMs": 300000
                    },
                    {
                      "durationMs": 900000
                    },
                    {
                      "durationMs": 1800000
                    },
                    {
                      "durationMs": 3600000
                    },
                    {
                      "durationMs": 14400000
                    },
                    {
                      "durationMs": 43200000
                    },
                    {
                      "durationMs": 86400000
                    },
                    {
                      "durationMs": 172800000
                    },
                    {
                      "durationMs": 259200000
                    },
                    {
                      "durationMs": 604800000
                    },
                    {
                      "durationMs": 1209600000
                    },
                    {
                      "durationMs": 2419200000
                    },
                    {
                      "durationMs": 2592000000
                    },
                    {
                      "durationMs": 5184000000
                    },
                    {
                      "durationMs": 7776000000
                    }
                  ]
                }
              }
            ],
            "style": "pills",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          "customWidth": "100",
          "name": "WSSelector"
        },
        {
          "type": 1,
          "content": {
            "json": "### Help\r\nSelect **Subscription**, **Workspace** and **TimeRange** from the drop-down above.\r\nThe workbook will display details according to your selections.",
            "style": "info"
          },
          "conditionalVisibility": {
            "parameterName": "Help",
            "comparison": "isEqualTo",
            "value": "Yes"
          },
          "name": "Help text"
        },
        {
          "type": 11,
          "content": {
            "version": "LinkItem/1.0",
            "style": "tabs",
            "links": [
              {
                "id": "7850dd6b-7840-4c4c-8847-c5d7f22b83d8",
                "cellValue": "selectedTab",
                "linkTarget": "parameter",
                "linkLabel": "Overview",
                "subTarget": "Overview",
                "preText": "Overview",
                "style": "link"
              },
              {
                "id": "925ac395-7f50-4735-a654-ed8a4a9bcde4",
                "cellValue": "selectedTab",
                "linkTarget": "parameter",
                "linkLabel": "Schema Details",
                "subTarget": "Schema Details",
                "style": "link"
              },
              {
                "id": "d2597c22-52b4-48d6-aac9-e024145302ec",
                "cellValue": "selectedTab",
                "linkTarget": "parameter",
                "linkLabel": "Retention",
                "subTarget": "Retention",
                "style": "link"
              },
              {
                "id": "5e3a2b42-0264-44c5-8975-ebc5bf177a70",
                "cellValue": "selectedTab",
                "linkTarget": "parameter",
                "linkLabel": "Agents Info",
                "subTarget": "Agents Info",
                "style": "link"
              }
            ]
          },
          "name": "links - 8"
        },
        {
          "type": 12,
          "content": {
            "version": "NotebookGroup/1.0",
            "groupType": "editable",
            "items": [
              {
                "type": 1,
                "content": {
                  "json": "#### This workbook contains\r\n\r\n<ol>\r\n  <li> Overview\r\n    <ul>\r\n\t  <li>View Permissions for the workspace</li>\r\n      <li>Enabled Data Connectors</li>\r\n      <li>Workspace Status</li>\r\n      <li>Alerts across Product Name & Provider Name</li>\r\n      <li>Created Analytic Rules</li>\r\n      <li>Created WatchLists</li>\r\n      <li>Saved Workbooks</li>\r\n      <li>Saved Searches</li>\r\n      <li>Workspace Functions</li>\r\n      <li>IntelligencePacks</li>\r\n     </ul>\r\n  </li>\r\n  <li>Schema Details\r\n    <ul>\r\n      <li>Supported Operations</li>\r\n      <li>Table Details</li>\r\n    </ul>\r\n  </li>\r\n  <li>Retention\r\n      <ul>\r\n       <li>Workspace Details</li>\r\n       <li>Table based retention</li>\r\n      </ul>\r\n  </li>\r\n  <li>Agents Info\r\n    <ul>\r\n      <li>List of Computer checkin</li>\r\n      <li>Data sources for Windows Event Logs</li>\r\n      <li>Data sources for Windows Performance Counter Logs Logs</li>\r\n      <li>Data sources for Windows Performance Counter Logs Logs</li>\r\n      <li>Data sources for LinuxPerformanceCollection Logs</li>\r\n    </ul>\r\n  </li>\r\n</ol>\r\n\r\n#### Below widget only displays a limit set of supported connectors.\r\n#### Please refer the workspace status for a detailed data source view.",
                  "style": "upsell"
                },
                "name": "text - 9"
              },
              {
                "type": 11,
                "content": {
                  "version": "LinkItem/1.0",
                  "style": "list",
                  "links": [
                    {
                      "id": "10c9b2c5-8ae9-4c6c-8129-924b663d7362",
                      "cellValue": "/subscriptions/{Subscription:id}/resourceGroups/{InternalRG:name}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}",
                      "linkTarget": "Resource",
                      "linkLabel": "View Permissions",
                      "subTarget": "users",
                      "preText": "Click this link to ",
                      "postText": "for the {Workspace:name}",
                      "style": "primary",
                      "linkIsContextBlade": true
                    }
                  ]
                },
                "name": "links - 10"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/providers/Microsoft.SecurityInsights/dataConnectors\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-09-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Enabled Data Connectors for {Workspace:name}",
                  "queryType": 12,
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "id",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "etag",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "type",
                        "formatter": 5
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true
                  }
                },
                "name": "Enabled Data Connectors - Copy"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "union withsource=_TableName *\r\n| where TimeGenerated {TimeRange:query}\r\n| summarize Entries = count(), Size = sum(_BilledSize), last_log = datetime_diff(\"second\",now(), max(TimeGenerated)), estimate  = sumif(_BilledSize, _IsBillable==true)  by _TableName, _IsBillable\r\n| project ['Table Name'] = _TableName,['Last Record Received Ago']= last_log, ['Table Size'] = Size, ['Table Entries'] = Entries,\r\n          ['Size per Entry'] = 1.0 * Size / Entries, ['IsBillable'] = _IsBillable\r\n| order by ['Table Size']  desc\r\n\r\n ",
                  "size": 0,
                  "title": "{Workspace:name} workspace status for {TimeRange:label}",
                  "timeContext": {
                    "durationMs": 7776000000
                  },
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "Last Record Received Ago",
                        "formatter": 8,
                        "formatOptions": {
                          "palette": "greenRed"
                        },
                        "numberFormat": {
                          "unit": 24,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Table Size",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "purpleRed"
                        },
                        "numberFormat": {
                          "unit": 2,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Table Entries",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "grayBlue"
                        },
                        "numberFormat": {
                          "unit": 17,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Size per Entry",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "turquoise"
                        },
                        "numberFormat": {
                          "unit": 2,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "IsBillable",
                        "formatter": 18,
                        "formatOptions": {
                          "thresholdsOptions": "colors",
                          "thresholdsGrid": [
                            {
                              "operator": "==",
                              "thresholdValue": "True",
                              "representation": "green",
                              "text": "{0}{1}"
                            },
                            {
                              "operator": "==",
                              "thresholdValue": "False",
                              "representation": "gray",
                              "text": "{0}{1}"
                            },
                            {
                              "operator": "Default",
                              "thresholdValue": null,
                              "text": "{0}{1}"
                            }
                          ],
                          "customColumnWidthSetting": "10%"
                        },
                        "numberFormat": {
                          "unit": 0,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Last Logged Ago",
                        "formatter": 8,
                        "formatOptions": {
                          "palette": "greenRed"
                        },
                        "numberFormat": {
                          "unit": 24,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true
                  }
                },
                "name": "query - 7"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "SecurityAlert\r\n| where TimeGenerated > ago(90d)\r\n| summarize arg_max(TimeGenerated,*) by SystemAlertId\r\n| summarize AlertCount= count() by ProductName, ProviderName",
                  "size": 0,
                  "title": "Alerts from Product Name & Provider Name in {Workspace:name} for {TimeRange:label}",
                  "timeContext": {
                    "durationMs": 7776000000
                  },
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces",
                  "visualization": "table",
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "Last Record Received Ago",
                        "formatter": 8,
                        "formatOptions": {
                          "palette": "greenRed"
                        },
                        "numberFormat": {
                          "unit": 24,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Table Size",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "purpleRed"
                        },
                        "numberFormat": {
                          "unit": 2,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Table Entries",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "grayBlue"
                        },
                        "numberFormat": {
                          "unit": 17,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Size per Entry",
                        "formatter": 3,
                        "formatOptions": {
                          "palette": "turquoise"
                        },
                        "numberFormat": {
                          "unit": 2,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "IsBillable",
                        "formatter": 18,
                        "formatOptions": {
                          "thresholdsOptions": "colors",
                          "thresholdsGrid": [
                            {
                              "operator": "==",
                              "thresholdValue": "True",
                              "representation": "green",
                              "text": "{0}{1}"
                            },
                            {
                              "operator": "==",
                              "thresholdValue": "False",
                              "representation": "gray",
                              "text": "{0}{1}"
                            },
                            {
                              "operator": "Default",
                              "thresholdValue": null,
                              "text": "{0}{1}"
                            }
                          ],
                          "customColumnWidthSetting": "10%"
                        },
                        "numberFormat": {
                          "unit": 0,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      },
                      {
                        "columnMatch": "Last Logged Ago",
                        "formatter": 8,
                        "formatOptions": {
                          "palette": "greenRed"
                        },
                        "numberFormat": {
                          "unit": 24,
                          "options": {
                            "style": "decimal"
                          }
                        }
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true
                  }
                },
                "name": "query - 7 - Copy"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/providers/Microsoft.SecurityInsights/alertRules\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-10-01-preview\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"$.properties.displayName\",\"columnid\":\"RuleName\"},{\"path\":\"$.properties.description\",\"columnid\":\"Description\"},{\"path\":\"$.kind\",\"columnid\":\"Kind\"},{\"path\":\"$.properties.productFilter\",\"columnid\":\"ProductName\"},{\"path\":\"$.properties.tactics\",\"columnid\":\"Tactics\"},{\"path\":\"$.properties.enabled\",\"columnid\":\"Status\"},{\"path\":\"$.properties\",\"columnid\":\"prop\"},{\"path\":\"$.properties.lastModifiedUtc\",\"columnid\":\"lastModifiedUtc\"}]}}]}",
                  "size": 0,
                  "title": "Created Analytic Rules",
                  "noDataMessage": "No analytic rules are defined ",
                  "showExportToExcel": true,
                  "exportToExcelOptions": "all",
                  "queryType": 12,
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "Kind",
                        "formatter": 1
                      },
                      {
                        "columnMatch": "ProductName",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "Tactics",
                        "formatter": 5,
                        "formatOptions": {
                          "customColumnWidthSetting": "0ch"
                        }
                      },
                      {
                        "columnMatch": "Status",
                        "formatter": 18,
                        "formatOptions": {
                          "thresholdsOptions": "icons",
                          "thresholdsGrid": [
                            {
                              "operator": "==",
                              "thresholdValue": "1",
                              "representation": "success",
                              "text": "enabled"
                            },
                            {
                              "operator": "==",
                              "thresholdValue": "0",
                              "representation": "disabled",
                              "text": "disabled"
                            },
                            {
                              "operator": "==",
                              "thresholdValue": "false",
                              "representation": "disabled",
                              "text": "disabled"
                            },
                            {
                              "operator": "Default",
                              "thresholdValue": null,
                              "representation": "success",
                              "text": "enabled"
                            }
                          ]
                        }
                      },
                      {
                        "columnMatch": "prop",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "enabled",
                        "formatter": 3,
                        "formatOptions": {
                          "min": 0,
                          "max": 1,
                          "palette": "redGreen",
                          "compositeBarSettings": {
                            "labelText": "",
                            "columnSettings": [
                              {
                                "columnName": "enabled",
                                "color": "green"
                              }
                            ]
                          }
                        }
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true,
                    "sortBy": [
                      {
                        "itemKey": "lastModifiedUtc",
                        "sortOrder": 2
                      }
                    ],
                    "labelSettings": [
                      {
                        "columnId": "RuleName",
                        "label": "Rule name"
                      },
                      {
                        "columnId": "Kind",
                        "label": "Rule type"
                      },
                      {
                        "columnId": "ProductName",
                        "label": "Product name"
                      }
                    ]
                  },
                  "sortBy": [
                    {
                      "itemKey": "lastModifiedUtc",
                      "sortOrder": 2
                    }
                  ],
                  "graphSettings": {
                    "type": 0
                  },
                  "mapSettings": {
                    "locInfo": "LatLong"
                  }
                },
                "name": "Created Analytic Rules"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/providers/Microsoft.SecurityInsights/watchlists\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-04-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Created WatchLists",
                  "showExportToExcel": true,
                  "queryType": 12,
                  "gridSettings": {
                    "rowLimit": 10000,
                    "filter": true,
                    "labelSettings": [
                      {
                        "columnId": "id",
                        "label": "Link"
                      },
                      {
                        "columnId": "name",
                        "label": "Name"
                      },
                      {
                        "columnId": "type",
                        "label": "Type"
                      },
                      {
                        "columnId": "systemData",
                        "label": "System Data"
                      },
                      {
                        "columnId": "properties",
                        "label": "Properties"
                      }
                    ]
                  }
                },
                "name": "Created WatchLists"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "resources\r\n| where ['type'] == \"microsoft.insights/workbooks\" \r\n| where properties['category'] == \"sentinel\" and  tolower(properties.['sourceId']) == tolower(\"{Workspace}\")\r\n| project ['Workbook Name'] = properties.['displayName'], kind, location, resourceGroup, Link = id\r\n",
                  "size": 0,
                  "title": "Saved Workbooks",
                  "queryType": 1,
                  "resourceType": "microsoft.resourcegraph/resources",
                  "gridSettings": {
                    "filter": true,
                    "labelSettings": [
                      {
                        "columnId": "kind",
                        "label": "Kind"
                      },
                      {
                        "columnId": "location",
                        "label": "Location"
                      },
                      {
                        "columnId": "resourceGroup",
                        "label": "Resource Group"
                      },
                      {
                        "columnId": "Link",
                        "label": "Link"
                      }
                    ]
                  }
                },
                "name": "Saved Workbooks"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourcegroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/savedSearches\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-06-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"$.name\",\"columnid\":\"name\"},{\"path\":\"$.properties.category\",\"columnid\":\"category\"},{\"path\":\"$.properties.displayName\",\"columnid\":\"displayName\"},{\"path\":\"$.properties.query\",\"columnid\":\"query\"}]}}]}",
                  "size": 0,
                  "title": "Saved Searches",
                  "queryType": 12,
                  "visualization": "table",
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "name",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "category",
                        "formatter": 5
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true,
                    "hierarchySettings": {
                      "treeType": 1,
                      "groupBy": [
                        "category"
                      ],
                      "expandTopLevel": false
                    },
                    "labelSettings": [
                      {
                        "columnId": "category",
                        "label": "Category"
                      },
                      {
                        "columnId": "displayName",
                        "label": "Display Name"
                      },
                      {
                        "columnId": "query",
                        "label": "Query"
                      }
                    ]
                  },
                  "sortBy": []
                },
                "name": "Saved Searches"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/metadata\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2017-10-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.functions\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Workspace Functions",
                  "noDataMessage": "There are no functions on this workspace.",
                  "noDataMessageStyle": 2,
                  "queryType": 12,
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "id",
                        "formatter": 5
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true,
                    "sortBy": [
                      {
                        "itemKey": "name",
                        "sortOrder": 1
                      }
                    ],
                    "labelSettings": [
                      {
                        "columnId": "name",
                        "label": "Name",
                        "comment": ""
                      },
                      {
                        "columnId": "body",
                        "label": "Function Definition"
                      },
                      {
                        "columnId": "category",
                        "label": "Category"
                      },
                      {
                        "columnId": "displayName",
                        "label": "Display Name"
                      }
                    ]
                  },
                  "sortBy": [
                    {
                      "itemKey": "name",
                      "sortOrder": 1
                    }
                  ]
                },
                "name": "Workspace Functions"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/intelligencePacks\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2020-08-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"columns\":[{\"path\":\"$.name\",\"columnid\":\"Name\"},{\"path\":\"$.displayname\",\"columnid\":\"DisplayName\"},{\"path\":\"$.enabled\",\"columnid\":\"Enabled\"}]}}]}",
                  "size": 0,
                  "title": "IntelligencePacks",
                  "queryType": 12,
                  "visualization": "table",
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "Enabled",
                        "formatter": 18,
                        "formatOptions": {
                          "thresholdsOptions": "icons",
                          "thresholdsGrid": [
                            {
                              "operator": "==",
                              "thresholdValue": "true",
                              "representation": "success",
                              "text": "Yes"
                            },
                            {
                              "operator": "==",
                              "thresholdValue": "false",
                              "representation": "3",
                              "text": "No"
                            },
                            {
                              "operator": "Default",
                              "thresholdValue": null,
                              "representation": "success",
                              "text": "{0}{1}"
                            }
                          ]
                        }
                      },
                      {
                        "columnMatch": "modifiedDate",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "createdDate",
                        "formatter": 5
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true,
                    "sortBy": [
                      {
                        "itemKey": "$gen_thresholds_Enabled_2",
                        "sortOrder": 2
                      }
                    ]
                  },
                  "sortBy": [
                    {
                      "itemKey": "$gen_thresholds_Enabled_2",
                      "sortOrder": 2
                    }
                  ]
                },
                "name": "query - 2"
              }
            ]
          },
          "conditionalVisibility": {
            "parameterName": "selectedTab",
            "comparison": "isEqualTo",
            "value": "Overview"
          },
          "name": "Overview"
        },
        {
          "type": 12,
          "content": {
            "version": "NotebookGroup/1.0",
            "groupType": "editable",
            "items": [
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/providers/Microsoft.SecurityInsights/operations\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2021-10-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Supported Operations",
                  "queryType": 12,
                  "gridSettings": {
                    "rowLimit": 10000,
                    "filter": true
                  }
                },
                "name": "Supported Operations"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/metadata\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2017-10-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.tables\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Table Details",
                  "queryType": 12,
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "id",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "timespanColumn",
                        "formatter": 5
                      },
                      {
                        "columnMatch": "columns",
                        "formatter": 7,
                        "formatOptions": {
                          "linkTarget": "CellDetails",
                          "linkIsContextBlade": true,
                          "bladeOpenContext": {
                            "bladeParameters": []
                          }
                        }
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true,
                    "labelSettings": [
                      {
                        "columnId": "name",
                        "label": "Table Name"
                      },
                      {
                        "columnId": "tableType",
                        "label": "Source"
                      },
                      {
                        "columnId": "columns",
                        "label": "Schema"
                      }
                    ]
                  }
                },
                "name": "Table Details"
              }
            ]
          },
          "conditionalVisibility": {
            "parameterName": "selectedTab",
            "comparison": "isEqualTo",
            "value": "Schema Details"
          },
          "name": "Schema Details"
        },
        {
          "type": 12,
          "content": {
            "version": "NotebookGroup/1.0",
            "groupType": "editable",
            "items": [
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}?api-version=2017-04-26-preview\",\"urlParams\":[],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$\",\"columns\":[]}}]}",
                  "size": 1,
                  "title": "Workspace Details",
                  "queryType": 12,
                  "visualization": "table"
                },
                "name": "WorkspaceDetails"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/Tables?api-version=2017-04-26-preview\",\"urlParams\":[],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[{\"path\":\"name\",\"columnid\":\"TableName\"},{\"path\":\"properties.retentionInDays\",\"columnid\":\"RetentionInDays\"}]}}]}",
                  "size": 0,
                  "title": "Table based retention",
                  "queryType": 12,
                  "visualization": "table",
                  "gridSettings": {
                    "formatters": [
                      {
                        "columnMatch": "Id",
                        "formatter": 13,
                        "formatOptions": {
                          "linkTarget": null,
                          "showIcon": true
                        }
                      }
                    ],
                    "rowLimit": 10000,
                    "filter": true
                  }
                },
                "name": "query - 0"
              }
            ]
          },
          "conditionalVisibility": {
            "parameterName": "selectedTab",
            "comparison": "isEqualTo",
            "value": "Retention"
          },
          "name": "Retention"
        },
        {
          "type": 12,
          "content": {
            "version": "NotebookGroup/1.0",
            "groupType": "editable",
            "items": [
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "Heartbeat\r\n| summarize arg_max(TimeGenerated,*) by Computer",
                  "size": 0,
                  "title": "List of Computer checkin in to {Workspace:name}",
                  "noDataMessage": "No Computer has checked-in during the specified time frame.",
                  "noDataMessageStyle": 4,
                  "timeContext": {
                    "durationMs": 7776000000
                  },
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces"
                },
                "showPin": false,
                "name": "query - 0"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/dataSources?$filter=kind eq 'WindowsEvent'\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2020-08-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Data sources for Windows Event Logs for {Workspace:name}",
                  "noDataMessage": "No Events Configured.",
                  "noDataMessageStyle": 4,
                  "queryType": 12,
                  "gridSettings": {
                    "filter": true
                  }
                },
                "name": "query - 1"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/dataSources?$filter=kind eq 'WindowsPerformanceCounter'\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2020-08-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Data sources for Windows Performance Counter Logs Logs for {Workspace:name}",
                  "noDataMessage": "No Windows Performance Counter Configured.",
                  "noDataMessageStyle": 4,
                  "queryType": 12
                },
                "name": "query - 1 - Copy"
              },
              {
                "type": 3,
                "content": {
                  "version": "KqlItem/1.0",
                  "query": "{\"version\":\"ARMEndpoint/1.0\",\"data\":null,\"headers\":[],\"method\":\"GET\",\"path\":\"/subscriptions/{Subscription:id}/resourceGroups/{InternalRG}/providers/Microsoft.OperationalInsights/workspaces/{Workspace:name}/dataSources?$filter=kind eq 'LinuxPerformanceCollection'\",\"urlParams\":[{\"key\":\"api-version\",\"value\":\"2020-08-01\"}],\"batchDisabled\":false,\"transformers\":[{\"type\":\"jsonpath\",\"settings\":{\"tablePath\":\"$.value\",\"columns\":[]}}]}",
                  "size": 0,
                  "title": "Data sources for LinuxPerformanceCollection Logs for {Workspace:name}",
                  "noDataMessage": "No Collection Configured.",
                  "noDataMessageStyle": 4,
                  "queryType": 12
                },
                "name": "query - 1 - Copy - Copy"
              }
            ]
          },
          "conditionalVisibility": {
            "parameterName": "selectedTab",
            "comparison": "isEqualTo",
            "value": "Agents Info"
          },
          "name": "group - 8"
        }
      ],
      "isLocked": false,
      "fromTemplateId": "sentinel-UserWorkbook"
    }
  },
  "resources": [
    {
      "name": "[parameters('workbookId')]",
      "type": "microsoft.insights/workbooks",
      "location": "[resourceGroup().location]",
      "apiVersion": "2021-03-08",
      "dependsOn": [],
      "kind": "shared",
      "properties": {
        "displayName": "[parameters('workbookDisplayName')]",
        "serializedData": "[string(variables('workbookContent'))]",
        "version": "1.0",
        "sourceId": "[parameters('workbookSourceId')]",
        "category": "[parameters('workbookType')]"
      }
    }
  ],
  "outputs": {
    "workbookId": {
      "type": "string",
      "value": "[resourceId( 'microsoft.insights/workbooks', parameters('workbookId'))]"
    }
  },
  "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
}
